"""
==================
Author:Chloeee
Time:2021/4/13 21:49
Contact:403505960@qq.com
==================
"""

# 加法数据及用例名称
data_add_int = [
    [0,0,0],[1,2,3],[3,7,10],[10000,10000,20000]
]
ids_add_int = ["测试0加0","测试1加2","测试进位","测试5位数相加"]


data_add_float = [
    [0.01,0,0.01],[1,0.01,1.01],[1.5,1.5,3],[0.1,0.2,0.3]
]
ids_add_float = ["测试0加0.01","测试1加0.01","测试小数相加形成整数","测试特殊0.2加0.1"]



# 除法数据及用例名称
data_divide = [
    [300,3,100], [100,3,33.33], [100,6,16.67], [3,2,1.5], [5,4,1.25],[0.2,0.02,10],
    [3,0,'error'],[0,3,0],['abc',0,'error']
]
ids_divide = ["测试整除", "测试无限小数-不四舍五入", "测试无效小数-四舍五入",
              "测试结果一位小数", "测试结果两位小数","测试小数相除","除以0","0除以整数","除数有字符串"]

